Revit 2017 API
Application.NewPlane Method (XYZ, XYZ)
Creates a new geometric plane object based on a normal vector and an origin.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Revit 2017. Please use Plane.CreateByNormalAndOrigin() instead.")]
public Plane NewPlane(
	XYZ norm,
	XYZ origin
)
Visual Basic
<ObsoleteAttribute("This method is obsolete in Revit 2017. Please use Plane.CreateByNormalAndOrigin() instead.")> _
Public Function NewPlane ( _
	norm As XYZ, _
	origin As XYZ _
) As Plane
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Revit 2017. Please use Plane.CreateByNormalAndOrigin() instead.")]
public:
Plane^ NewPlane(
	XYZ^ norm,
	XYZ^ origin
)
Parameters
norm
Type: Autodesk.Revit.DB.XYZ
Z vector of the plane coordinate system.
origin
Type: Autodesk.Revit.DB.XYZ
Origin of the plane coordinate system.
Return Value
A new plane object.
Examples
CopyC#
 // Create a geometry plane in Revit application
XYZ normal = XYZ.BasisZ;    // use basis of the z-axis (0,0,1) for normal vector
XYZ origin = XYZ.Zero;  // origin is (0,0,0)
Plane geomPlane = Plane.CreateByNormalAndOrigin(normal, origin);
CopyVB.NET
   ' Create a geometry plane in Revit application
   Dim normal As XYZ = XYZ.BasisZ
   ' use basis of the z-axis (0,0,1) for normal vector
   Dim origin As XYZ = XYZ.Zero
   ' origin is (0,0,0)
Dim geomPlane As Plane = Plane.CreateByNormalAndOrigin(normal, origin)
See Also
Application Class
NewPlane Overload
Autodesk.Revit.Creation Namespace